Каркасная_база_для_ЕДТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <tabularSections>
    <name>ПраваДоступа</name>
    <attributes>
      <name>Включена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Каркасная_база_для_ЕДТ/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ТекущийПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если НЕ ТекущийПользователь <> Неопределено Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Наименование;
		НовыйПользователь.Пароль = "12345678";
		СтруктураОтбора = Новый Структура("Включена", Истина);
		ПраваПользователя = ПраваДоступа.НайтиСтроки(СтруктураОтбора);
		Для каждого Роль Из ПраваПользователя Цикл
			ВыбраннаяРоль = Метаданные.Роли.Найти(Роль.ИмяРоли);
			НовыйПользователь.Роли.Добавить(ВыбраннаяРоль);
		КонецЦикла;
		НовыйПользователь.Записать();
	Иначе 
		ТекущийПользователь.Роли.Очистить();
		СтруктураОтбора = Новый Структура("Включена", Истина);
		ПраваПользователя = ПраваДоступа.НайтиСтроки(СтруктураОтбора);
		Для каждого Роль Из ПраваПользователя Цикл
			ВыбраннаяРоль = Метаданные.Роли.Найти(Роль.ИмяРоли);
			ТекущийПользователь.Роли.Добавить(ВыбраннаяРоль);
		КонецЦикла;
		ТекущийПользователь.Записать();		
	КонецЕсли;
КонецПроцедуры
